АлогистикТест2/src/InformationRegisters/алк_КубатурникКруглогоЛеса/алк_КубатурникКруглогоЛеса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_КубатурникКруглогоЛеса</name>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДлинаМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СечениеМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКубатурника</name>
    <type>
      <types>EnumRef.алк_ТипыКубатурников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_КубатурникКруглогоЛеса/ManagerModule.bsl
Функция ПолучитьЗначениеОбъема(ДлинаМ, СечениеМ, ТипКубатурника) Экспорт
	Результат = 0;
	Запрос = новый запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	алк_КубатурникКруглогоЛеса.Объем как Объем
	|ИЗ
	|	РегистрСведений.алк_КубатурникКруглогоЛеса КАК алк_КубатурникКруглогоЛеса
	|ГДЕ
	|	алк_КубатурникКруглогоЛеса.ДлинаМ = &ДлинаМ
	|	И алк_КубатурникКруглогоЛеса.СечениеМ = &СечениеМ
	|	И алк_КубатурникКруглогоЛеса.ТипКубатурника = &ТипКубатурника");
	Запрос.УстановитьПараметр("ДлинаМ", ДлинаМ);
	Запрос.УстановитьПараметр("СечениеМ", СечениеМ);
	Запрос.УстановитьПараметр("ТипКубатурника", ТипКубатурника);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() тогда
		Результат = РезультатЗапроса.Объем;
	КонецЕсли;
	Возврат Результат;
КонецФункции
